<?php
$spell_register_versions = [
    [
        'date' => '2022年10月22日',
        'version' => 'v1.2.0',
        'detail' => 'マスタデータの登録・編集・表示機能の追加',
    ],
    [
        'date' => '2022年10月14日',
        'version' => 'v1.1.1',
        'detail' => 'DB内のマスタデータをjsonファイルにする機能の追加',
    ],
    [
        'date' => '2022年10月13日',
        'version' => 'v1.1.0',
        'detail' => 'プロンプト一覧の検索システムの追加',
    ],
    [
        'date' => '2022年10月12日',
        'version' => 'v1.0.1',
        'detail' => '2^31 (2147483649)以上のシード値が正しく登録されない問題の修正',
    ],
    [
        'date' => '2022年10月12日',
        'version' => 'v1.0.0',
        'detail' => 'アプリリリース',
    ],
];