const versions = [
    {
        date: '2022年11月19日',
        version: '1.6.0',
        detail: 'ジェネレーターのレスポンシブ対応(暫定)',
    },
    {
        date: '2022年11月17日',
        version: '1.5.1',
        detail: '年齢制限選択の拡張、一部不具合修正',
    },
    {
        date: '2022年11月17日',
        version: '1.5.0',
        detail: 'セーバートップーページのリニューアル、その他細かい画面表示修正',
    },
    {
        date: '2022年11月15日',
        version: '1.4.1',
        detail: '生成したプロンプトをStable Diffusion WebUI用に変更可能に',
    },
    {
        date: '2022年11月10日',
        version: '1.4.0',
        detail: '一部UIの変更、プロンプトの手動追加機能・生成されたプロンプトの編集機能・プリセット登録での画像ドラッグ&ドロップ追加機能を作成',
    },
    {
        date: '2022年11月7日',
        version: '1.3.1',
        detail: '一部プロンプトの色選択機能の追加',
    },
    {
        date: '2022年11月5日',
        version: '1.3.0',
        detail: 'プリセット一覧のUI刷新、プリセットの画像アップロード機能を追加',
    },
    {
        date: '2022年11月1日',
        version: '1.2.0',
        detail: 'UIの大幅刷新、全年齢・R-18切り替え可能に、プロンプトのカテゴライズ変更・追加',
    },
    {
        date: '2022年10月29日',
        version: '1.1.0',
        detail: '本アプリから直接DB登録を可能に',
    },
    {
        date: '2022年10月25日',
        version: '1.0.0',
        detail: 'アプリ本リリース、ジェネレーターとセーバーのフォルダを統一',
    },
    {
        date: '2022年10月24日',
        version: 'beta-3.0.1',
        detail: '利用規約・プライバシーポリシーの追加',
    },
    {
        date: '2022年10月24日',
        version: 'beta-3.0.0',
        detail: '[ジェネレーター] UIの刷新、ソート機能をドラッグ&ドロップ可能に',
    },
    {
        date: '2022年10月22日',
        version: 'beta-2.3.0',
        detail: '[セーバー] マスタデータの登録・編集・表示機能の追加',
    },
    {
        date: '2022年10月19日',
        version: 'beta-2.2.0',
        detail: '[ジェネレーター] 設定プロンプトのソート機能の追加',
    },
    {
        date: '2022年10月14日',
        version: 'beta-2.1.1',
        detail: '[セーバー] マスタデータをjsonに変換する機能の追加',
    },
    {
        date: '2022年10月13日',
        version: 'beta-2.1.0',
        detail: '[セーバー] プリセット検索システムの追加',
    },
    {
        date: '2022年10月12日',
        version: 'beta-2.0.0',
        detail: '[セーバー] 機能公開(限定公開)',
    },
    {
        date: '2022年10月8日',
        version: 'beta-1.0.0',
        detail: '[ジェネレーター] アプリプレリリース(限定公開)',
    },
]
export default versions